post-product-service.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 10
    - duration: 240
      arrivalRate: 10
      rampTo: 1000
    - duration: 60
      arrivalRate: 1000

scenarios:
  - flow:
      - post:
          url: "/v1/products/"
          json:
            name: "{{ $randomString() }}"
            description: "Product Description"
            variants:
              - name: "variant name 0"
                height: 1.3
                stock: 10
                price: 100000
                weight: 1.5
                active_time: "2023-08-18T06:20"
                is_active: false
              - name: "variant name 1"
                height: 1.3
                stock: 10
                price: 100000
                weight: 1.5
                active_time: "2023-08-15T00:00"
                is_active: false
              - name: "variant name 2"
                height: 1.3
                stock: 10
                price: 100000
                weight: 1.5
                active_time: "2023-08-15T00:00"
                is_active: false
            is_active: true
          headers:
            Content-Type: "application/json"